import pandas as pd
import pytest


@pytest.fixture()
def excel_empty_file():
    """Excel-файл пустой"""
    return pd.DataFrame().to_excel("empty_file.xlsx", index=False)


@pytest.fixture()
def txt_file():
    """Файл формата txt"""
    with open("test_file.txt", "w", encoding="utf-8") as file:
        file.write("")
    return "test_file.txt"


@pytest.fixture()
def operations():
    """Банковские операции"""
    # operations_excel = pd.read_excel('../data/operations.xlsx')
    # return operations_excel.to_dict(orient="records")
    return [
        {
            "Дата операции": "23.03.2018 22:13:46",
            "Дата платежа": "27.03.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -10.00,
            "Валюта операции": "TRY",
            "Сумма платежа": -150.18,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Транспорт",
            "MCC": 4131.0,
            "Описание": "Московский транспорт",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 150.18,
        },
        {
            "Дата операции": "24.03.2018 15:06:16",
            "Дата платежа": "27.03.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -32.92,
            "Валюта операции": "RUB",
            "Сумма платежа": -32.92,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Транспорт",
            "MCC": 4131.0,
            "Описание": "Московский транспорт",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 32.92,
        },
        {
            "Дата операции": "22.03.2018 12:19:49",
            "Дата платежа": "24.03.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -310.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -310.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": float("nan"),
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "OOO Frittella",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 310.0,
        },
        {
            "Дата операции": "10.03.2018 22:17:45",
            "Дата платежа": "13.03.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -300.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -300.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 15.0,
            "Категория": "Ж/д билеты",
            "MCC": 4111.0,
            "Описание": "Московский метрополитен",
            "Бонусы (включая кэшбэк)": 15,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 300.0,
        },
        {
            "Дата операции": "27.02.2018 12:35:24",
            "Дата платежа": "01.03.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": 310.7,
            "Валюта операции": "RUB",
            "Сумма платежа": 310.7,
            "Валюта платежа": "RUB",
            "Кэшбэк": float("nan"),
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "OOO Frittella",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 310.7,
        },
    ]

