from unittest.mock import patch

from src.reader import reader_excel_file


@patch("src.reader.pd.read_excel")
def test_reader_excel_file(mock_read_excel):
    """Тест при excel файле c данными"""
    mock_read_excel.return_value.to_dict.return_value = """[
        {
        "Дата операции": "01.01.2018 20:27:51",
        "Дата платежа": "04.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -316.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -316.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": NaN,
        "Категория": "Красота",
        "MCC": 5977.0,
        "Описание": "OOO Balid",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 316.0
    },
    {
        "Дата операции": "01.01.2018 12:49:53",
        "Дата платежа": "01.01.2018",
        "Номер карты": NaN,
        "Статус": "OK",
        "Сумма операции": -3000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -3000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": NaN,
        "Категория": "Переводы",
        "MCC": NaN,
        "Описание": "Линзомат ТЦ Юность",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 3000.0
    }
]"""

    expected_result = """[
        {
        "Дата операции": "01.01.2018 20:27:51",
        "Дата платежа": "04.01.2018",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -316.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -316.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": NaN,
        "Категория": "Красота",
        "MCC": 5977.0,
        "Описание": "OOO Balid",
        "Бонусы (включая кэшбэк)": 6,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 316.0
    },
    {
        "Дата операции": "01.01.2018 12:49:53",
        "Дата платежа": "01.01.2018",
        "Номер карты": NaN,
        "Статус": "OK",
        "Сумма операции": -3000.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -3000.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": NaN,
        "Категория": "Переводы",
        "MCC": NaN,
        "Описание": "Линзомат ТЦ Юность",
        "Бонусы (включая кэшбэк)": 0,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 3000.0
    }
]"""
    assert reader_excel_file("mock_file.xlsx").replace(" ", "").replace("\n", "") == expected_result.strip().replace(
        " ", ""
    ).replace("\n", "")


def test_reader_excel_empty_file(excel_empty_file):
    """Тест при пустом excel файле"""
    result = reader_excel_file(excel_empty_file)
    assert result == "Файл пустой."


def test_reader_excel_file_file_not_found():
    """Тест, если файл не найден"""
    result = reader_excel_file("file_non_existent.xlsx")
    assert result == "Файл не найден."


def test_reader_excel_file_file_invalid_file_format(txt_file):
    """Тест, если файл с неправильным форматом"""
    result = reader_excel_file(txt_file)
    assert result == "Файл пустой или имеет неподдерживаемый формат."
